## Задание

Загрузите датасет titanic.csv и найдите ответы на вопросы<p>

1. Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел.<p>
2. Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.<p>
3. Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.<p>
4. Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.<p>
5. Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.<p>
6. Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [1]:
import pandas
data = pandas.read_csv('titanic.csv', index_col='PassengerId')

Посмотрим на данные

In [2]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Узнаем количество ехавших мужчин и женщин

In [3]:
data.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [4]:
data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

Определим процент выживших пассажиров

In [5]:
float(data.Survived.value_counts()[1])/len(data) * 100

38.38383838383838

In [6]:
data.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

Процент пассажиров первого класса

In [7]:
float(data.Pclass.value_counts()[1])/len(data) * 100

24.242424242424242

Среднее значение возраста

In [8]:
data.Age.mean()

29.69911764705882

Медианное значение возраста

In [9]:
data.Age.median()

28.0

Рассчитаем корреляцию Пирсона

In [10]:
import scipy.stats
scipy.stats.pearsonr(data.SibSp , data.Parch)

(0.41483769862015613, 2.2418236681398336e-38)

Отделим пассажиров-женщин

In [11]:
femaleIn = data.loc[data.Sex == 'female'].Name

Получим имена женщин на корабле

In [12]:
femaleName = femaleIn.apply(lambda x: x.split('.')[1].split('(')[0])

Рассмотрим имена, которые встречаются чаще всего

In [13]:
femaleName.value_counts()[:20]

                      16
 Mary                  6
 William               5
 Bertha                4
 Anna                  3
 Joseph                3
 Anna Sofia            3
 Thomas                3
 Hanora "Nora"         2
 Alice                 2
 Samuel                2
 Kate                  2
 Ellen "Nellie"        2
 Edward                2
 Marija                2
 Elizabeth             2
 James                 2
 Katherine "Katie"     2
 Margaret "Maggie"     1
 Rosalie               1
Name: Name, dtype: int64